devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
        if (major >= UART_DEV_COUNT) {
                errno = EIO;
                return STD_RET_ERROR;
        }

        if (!(USART_data[major] = calloc(1, sizeof(struct USART_data)))) {
                return STD_RET_ERROR;
        }

        *device_handle = USART_data[major];

        USART_data[major]->USART            = USART_peripherals[major];
        USART_data[major]->data_write_sem   = semaphore_new(1, 0);
        USART_data[major]->port_lock_rx_mtx = mutex_new(MUTEX_NORMAL);
        USART_data[major]->port_lock_tx_mtx = mutex_new(MUTEX_NORMAL);

        if (  !USART_data[major]->data_write_sem
           || !USART_data[major]->port_lock_rx_mtx
           || !USART_data[major]->port_lock_tx_mtx) {
                goto error;
        } else {
                semaphore_take(USART_data[major]->data_write_sem, 1);

                if (turn_on_USART(USART_data[major]->USART) != STD_RET_OK) {
                        goto error;
                }

                enable_USART(USART_data[major]->USART);

                if ((u32_t) USART_data[major]->USART == USART1_BASE) {
                        set_baud_rate(USART_data[major]->USART, UART_PCLK2_FREQ, UART_DEFAULT_BAUDRATE);
                } else {
                        set_baud_rate(USART_data[major]->USART, UART_PCLK1_FREQ, UART_DEFAULT_BAUDRATE);
                }

                if (UART_DEFAULT_WAKE_METHOD) {
                        wakeup_USART_on_address_mark(USART_data[major]->USART);
                } else {
                        wakeup_USART_on_idle_line(USART_data[major]->USART);
                }

                if (UART_DEFAULT_PARITY_ENABLE) {
                        enable_parity_check(USART_data[major]->USART);
                } else {
                        disable_parity_check(USART_data[major]->USART);
                }

                if (UART_DEFAULT_PARITY_SELECTION) {
                        enable_odd_parity(USART_data[major]->USART);
                } else {
                        enable_even_parity(USART_data[major]->USART);
                }

                if (UART_DEFAULT_TX_ENABLE) {
                        enable_transmitter(USART_data[major]->USART);
                } else {
                        disable_transmitter(USART_data[major]->USART);
                }

                if (UART_DEFAULT_RX_ENABLE) {
                        enable_receiver(USART_data[major]->USART);
                } else {
                        disable_receiver(USART_data[major]->USART);
                }

                if (UART_DEFAULT_RX_WAKEUP_MODE) {
                        receiver_wakeup_in_mute_mode(USART_data[major]->USART);
                } else {
                        receiver_wakeup_in_active_mode(USART_data[major]->USART);
                }

                if (UART_DEFAULT_LIN_ENABLE) {
                        enable_LIN_mode(USART_data[major]->USART);
                } else {
                        disable_LIN_mode(USART_data[major]->USART);
                }

                if (UART_DEFAULT_STOP_BITS) {
                        set_2_stop_bits(USART_data[major]->USART);
                } else {
                        set_1_stop_bit(USART_data[major]->USART);
                }

                if (UART_DEFAULT_LIN_BREAK_LEN_DET) {
                        detect_11_bit_LIN_break(USART_data[major]->USART);
                } else {
                        detect_10_bit_LIN_break(USART_data[major]->USART);
                }

                if (UART_DEFAULT_CTS_ENABLE) {
                        enable_CTS(USART_data[major]->USART);
                } else {
                        disable_CTS(USART_data[major]->USART);
                }

                if (UART_DEFAULT_RTS_ENABLE) {
                        enable_RTS(USART_data[major]->USART);
                } else {
                        disable_RTS(USART_data[major]->USART);
                }

                set_address_node(USART_data[major]->USART, UART_DEFAULT_MULTICOM_ADDRESS);

                if (enable_USART_interrupts(USART_data[major]->USART) != STD_RET_OK) {
                        goto error;
                }

                enable_RXNE_IRQ(USART_data[major]->USART);

                return STD_RET_OK;
        }

error:
        if (USART_data[major]->data_write_sem) {
                semaphore_delete(USART_data[major]->data_write_sem);
        }

        if (USART_data[major]->port_lock_rx_mtx) {
                mutex_delete(USART_data[major]->port_lock_rx_mtx);
        }

        if (USART_data[major]->port_lock_tx_mtx) {
                mutex_delete(USART_data[major]->port_lock_tx_mtx);
        }

        free(USART_data[major]);
        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_RELEASE(UART, void *device_handle)
{
        STOP_IF(device_handle == NULL);

        struct USART_data *hdl = device_handle;

        force_lock_mutex(hdl->port_lock_rx_mtx);
        force_lock_mutex(hdl->port_lock_tx_mtx);

        critical_section_begin();

        mutex_unlock(hdl->port_lock_rx_mtx);
        mutex_unlock(hdl->port_lock_tx_mtx);

        mutex_delete(hdl->port_lock_rx_mtx);
        mutex_delete(hdl->port_lock_tx_mtx);

        semaphore_delete(hdl->data_write_sem);
        turn_off_USART(hdl->USART);
        free(hdl);
        critical_section_end();

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_OPEN(UART, void *device_handle, int flags)
{
        UNUSED_ARG(flags);
        STOP_IF(device_handle == NULL);

