devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 * @param[in ]          *opened_by_task         task with opened this device (valid only if force is true)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_CLOSE(UART, void *device_handle, bool force, const task_t *opened_by_task)
{
        UNUSED_ARG(force);
        UNUSED_ARG(opened_by_task);

        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 *
 * @return number of written bytes, -1 if error
 */
//==============================================================================
API_MOD_WRITE(UART, void *device_handle, const u8_t *src, size_t count, u64_t *fpos)
{
        UNUSED_ARG(fpos);

        STOP_IF(device_handle == NULL);
        STOP_IF(src == NULL);
        STOP_IF(count == 0);

        struct USART_data *hdl = device_handle;

        size_t n = 0;
        if (mutex_lock(hdl->port_lock_tx_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                hdl->Tx_buffer.src_ptr   = src;
                hdl->Tx_buffer.data_size = count;

                enable_TXE_IRQ(hdl->USART);
                semaphore_take(hdl->data_write_sem, TXC_WAIT_TIME);

                n = count;

                mutex_unlock(hdl->port_lock_tx_mtx);
        } else {
                errno = EBUSY;
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 *
 * @return number of read bytes, -1 if error
 */
//==============================================================================
API_MOD_READ(UART, void *device_handle, u8_t *dst, size_t count, u64_t *fpos)
{
        UNUSED_ARG(fpos);

        STOP_IF(device_handle == NULL);
        STOP_IF(dst == NULL);
        STOP_IF(count == 0);

        struct USART_data *hdl = device_handle;

        size_t n = 0;
        if (mutex_lock(hdl->port_lock_rx_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                u8_t  *dst_ptr   = dst;
                size_t data_size = count;
                hdl->task_rx     = task_get_handle();

                do {
                        critical_section_begin();

                        if (hdl->Rx_FIFO.buffer_level > 0) {
                                *dst_ptr = hdl->Rx_FIFO.buffer[hdl->Rx_FIFO.read_index++];

                                if (hdl->Rx_FIFO.read_index >= UART_RX_BUFFER_SIZE)
                                        hdl->Rx_FIFO.read_index = 0;

                                hdl->Rx_FIFO.buffer_level--;
                                data_size--;
                                n++;

                                critical_section_end();
                        } else {
                                critical_section_end();
                                task_suspend_now();
                        }
                } while (data_size);

                mutex_unlock(hdl->port_lock_rx_mtx);
        } else {
                errno = EBUSY;
        }

        return n;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_IOCTL(UART, void *device_handle, int request, void *arg)
{
        STOP_IF(device_handle == NULL);

        struct USART_data *hdl = device_handle;
        stdret_t status = STD_RET_OK;

        switch (request) {
        case UART_IORQ_ENABLE_WAKEUP_IDLE:
                wakeup_USART_on_idle_line(hdl->USART);
                break;

        case UART_IORQ_ENABLE_WAKEUP_ADDRESS_MARK:
                wakeup_USART_on_address_mark(hdl->USART);
                break;

        case UART_IORQ_ENABLE_PARITY_CHECK:
                enable_parity_check(hdl->USART);
                break;

        case UART_IORQ_DISABLE_PARITY_CHECK:
                disable_parity_check(hdl->USART);
                break;

        case UART_IORQ_SET_ODD_PARITY:
                enable_odd_parity(hdl->USART);
                break;

        case UART_IORQ_SET_EVEN_PARITY:
                enable_even_parity(hdl->USART);
                break;

        case UART_IORQ_ENABLE_RECEIVER_WAKEUP_MUTE:
                receiver_wakeup_in_mute_mode(hdl->USART);
                break;

        case UART_IORQ_DISABLE_RECEIVER_WAKEUP_MUTE:
                receiver_wakeup_in_active_mode(hdl->USART);
                break;

        case UART_IORQ_ENABLE_LIN_MODE:
                enable_LIN_mode(hdl->USART);
                break;

        case UART_IORQ_DISABLE_LIN_MODE:
                disable_LIN_mode(hdl->USART);
                break;

        case UART_IORQ_SET_1_STOP_BIT:
                set_1_stop_bit(hdl->USART);
                break;

        case UART_IORQ_SET_2_STOP_BITS:
                set_2_stop_bits(hdl->USART);
                break;

        case UART_IORQ_SET_LIN_BRK_DETECTOR_11_BITS:
                detect_11_bit_LIN_break(hdl->USART);
                break;

        case UART_IORQ_SET_LIN_BRK_DETECTOR_10_BITS:
                detect_10_bit_LIN_break(hdl->USART);
                break;

        case UART_IORQ_SET_ADDRESS_NODE:
                set_address_node(hdl->USART, (int)arg);
                break;

        case UART_IORQ_ENABLE_CTS:
                enable_CTS(hdl->USART);
                break;

        case UART_IORQ_DISABLE_CTS:
                disable_CTS(hdl->USART);
                break;

        case UART_IORQ_ENABLE_RTS:
                enable_RTS(hdl->USART);
                break;

