devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
        case UART_IORQ_DISABLE_RTS:
                disable_RTS(hdl->USART);
                break;

        case UART_IORQ_GET_BYTE:
                critical_section_begin();

                if (!arg) {
                        critical_section_end();
                        errno  = EINVAL;
                        status = STD_RET_ERROR;
                        break;
                }

                if (hdl->Rx_FIFO.buffer_level > 0) {
                        *((u8_t*)arg) = hdl->Rx_FIFO.buffer[hdl->Rx_FIFO.read_index++];

                        if (hdl->Rx_FIFO.read_index >= UART_RX_BUFFER_SIZE)
                                hdl->Rx_FIFO.read_index = 0;

                        hdl->Rx_FIFO.buffer_level--;
                } else {
                        errno  = EIO;
                        status = STD_RET_ERROR;
                }

                critical_section_end();
                break;

        case UART_IORQ_GET_BYTE_BLOCKING:
                while (TRUE) {
                        critical_section_begin();

                        if (!arg) {
                                critical_section_end();
                                errno  = EINVAL;
                                status = STD_RET_ERROR;
                                break;
                        }

                        if (hdl->Rx_FIFO.buffer_level > 0) {
                                *((u8_t*)arg) = hdl->Rx_FIFO.buffer[hdl->Rx_FIFO.read_index++];

                                if (hdl->Rx_FIFO.read_index >= UART_RX_BUFFER_SIZE)
                                        hdl->Rx_FIFO.read_index = 0;

                                hdl->Rx_FIFO.buffer_level--;

                                critical_section_end();
                                break;
                        } else {
                                critical_section_end();
                                task_suspend_now();
                        }
                }
                break;

        case UART_IORQ_SEND_BYTE:
                while (!(hdl->USART->SR & USART_SR_TXE)) {
                        sleep_ms(1);
                }

                hdl->USART->DR = (int)arg;
                break;

        case UART_IORQ_SET_BAUDRATE:
                if ((u32_t)hdl->USART == USART1_BASE) {
                        set_baud_rate(hdl->USART, UART_PCLK2_FREQ, (int)arg);
                } else {
                        set_baud_rate(hdl->USART, UART_PCLK1_FREQ, (int)arg);
                }
                break;

        default:
                errno = EBADRQC;
                status = STD_RET_ERROR;
                break;
        }

        return status;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_FLUSH(UART, void *device_handle)
{
        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_STAT(UART, void *device_handle, struct vfs_dev_stat *device_stat)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(device_stat == NULL);

        device_stat->st_size  = 0;
        device_stat->st_major = 0;
        device_stat->st_minor = 0;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Interrupt handling
 *
 * @param usart   usart address
 * @param dev     device number
 */
//==============================================================================
static void IRQ_handler(struct USART_data *USART_data)
{
        /* transmitter interrupt handler */
        if (USART_data->USART->SR & USART_SR_TXE) {
                if (USART_data->Tx_buffer.data_size && USART_data->Tx_buffer.src_ptr) {
                        USART_data->USART->DR = *(USART_data->Tx_buffer.src_ptr++);

                        if (--USART_data->Tx_buffer.data_size == 0) {
                                USART_data->Tx_buffer.src_ptr = NULL;

                                int woken;
                                disable_TXE_IRQ(USART_data->USART);
                                semaphore_give_from_ISR(USART_data->data_write_sem, &woken);
                        }
                } else {
                        disable_TXE_IRQ(USART_data->USART);
                }
        }

        /* receiver interrupt handler */
        if (USART_data->USART->SR & USART_SR_RXNE) {
                u8_t DR = USART_data->USART->DR;

                if (USART_data->Rx_FIFO.buffer) {
                        if (USART_data->Rx_FIFO.buffer_level < UART_RX_BUFFER_SIZE) {
                                USART_data->Rx_FIFO.buffer[USART_data->Rx_FIFO.write_index++] = DR;

                        if (USART_data->Rx_FIFO.write_index >= UART_RX_BUFFER_SIZE)
                                USART_data->Rx_FIFO.write_index = 0;

                        USART_data->Rx_FIFO.buffer_level++;
                  }

                  if (USART_data->task_rx) {
                        if (task_resume_from_ISR(USART_data->task_rx)) {
                                task_yield();
                        }
                  }
            }
        }
}

//==============================================================================
/**
 * @brief Function enable USART clock
 *
 * @param[in] *USART            peripheral address
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t turn_on_USART(USART_t *USART)
{
        switch ((u32_t)USART) {
#if defined(RCC_APB2ENR_USART1EN) && (UART_1_ENABLE > 0)
        case USART1_BASE:
                RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
                break;
#endif
#if defined(RCC_APB1ENR_USART2EN) && (UART_2_ENABLE > 0)
        case USART2_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_USART2EN;
                break;
#endif
#if defined(RCC_APB1ENR_USART3EN) && (UART_3_ENABLE > 0)
        case USART3_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_USART3EN;
                break;
#endif
#if defined(RCC_APB1ENR_UART4EN)  && (UART_4_ENABLE > 0)
        case UART4_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_UART4EN;
                break;
#endif
#if defined(RCC_APB1ENR_UART5EN)  && (UART_5_ENABLE > 0)
        case UART5_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_UART5EN;
                break;
#endif
        default:
                errno = EIO;
                return STD_RET_ERROR;
        }

